# Database and Python interaction

In [3]:
pip install sqlalchemy

Collecting sqlalchemy
  Downloading SQLAlchemy-1.4.23-cp38-cp38-win_amd64.whl (1.5 MB)
Collecting greenlet!=0.4.17
  Downloading greenlet-1.1.1-cp38-cp38-win_amd64.whl (96 kB)
Installing collected packages: greenlet, sqlalchemy
Successfully installed greenlet-1.1.1 sqlalchemy-1.4.23
Note: you may need to restart the kernel to use updated packages.

In [6]:
from sqlalchemy import create_engine
import pandas as pd

In [7]:
database_connection = create_engine('sqlite:///sample.db')

Sample

In [11]:
dataframe = pd.read_sql_query('SELECT * FROM data', database_connection)

## Using SQLite 3

In [10]:
import sqlite3
conn = sqlite3.connect('example.db')
cursor = conn.cursor()

In [12]:
sql = '''CREATE TABLE EMPLOYEE(
    FIRST_NAME CHAR(20) NOT NULL,
    LAST_NAME CHAR(20),
    AGE INT,
    SEX CHAR(1),
    INCOME FLOAT
)'''
cursor.execute(sql)
conn.commit()

In [23]:
cursor.execute('''INSERT INTO EMPLOYEE(FIRST_NAME,LAST_NAME,AGE,SEX,INCOME) VALUES ('Diego', 'Ortiz', 39, 'M', 10500000)''')
cursor.execute('''INSERT INTO EMPLOYEE(FIRST_NAME,LAST_NAME,AGE,SEX,INCOME) VALUES ('Julio', 'Ortiz', 32, 'M', 5500000)''')
cursor.execute('''INSERT INTO EMPLOYEE(FIRST_NAME,LAST_NAME,AGE,SEX,INCOME) VALUES ('Martha', 'Matajira', 65, 'F', 2500000)''')
cursor.execute('''INSERT INTO EMPLOYEE(FIRST_NAME,LAST_NAME,AGE,SEX,INCOME) VALUES ('Lorena', 'Diaz', 37, 'F', 6500000)''')
conn.commit()

In [36]:
cursor.execute('''SELECT * FROM EMPLOYEE''')
result = cursor.fetchall()

In [37]:
result

[('Diego', 'Ortiz', 39, 'M', 10500000.0),
 ('Julio', 'Ortiz', 32, 'M', 5500000.0),
 ('Martha', 'Matajira', 65, 'F', 2500000.0),
 ('Lorena', 'Diaz', 37, 'F', 6500000.0)]

In [41]:
cursor.execute('''SELECT * FROM EMPLOYEE''')
result = cursor.fetchone()

In [42]:
result

('Diego', 'Ortiz', 39, 'M', 10500000.0)

In [43]:
cursor.execute('''INSERT INTO EMPLOYEE(FIRST_NAME,LAST_NAME,AGE,SEX,INCOME) VALUES ('Gladys', 'Escobar', 66, 'F', 2500000)''')
cursor.execute('''INSERT INTO EMPLOYEE(FIRST_NAME,LAST_NAME,AGE,SEX,INCOME) VALUES ('Miguel', 'Diaz', 32, 'F', 4500000)''')
conn.commit()

In [50]:
result = cursor.fetchmany(2)
result

[('Gladys', 'Escobar', 66, 'F', 2500000.0),
 ('Miguel', 'Diaz', 32, 'F', 4500000.0)]

### Update rows

In [57]:
cursor.execute('''UPDATE EMPLOYEE SET FIRST_NAME = 'Leonard' WHERE FIRST_NAME = 'Diego' ''')
cursor.execute('''UPDATE EMPLOYEE SET AGE = AGE + 1 WHERE SEX = 'M' ''')
conn.commit()

### Delete rows

In [63]:
cursor.execute('''DELETE FROM EMPLOYEE WHERE AGE > 60 ''')
conn.commit()

### Dataframe from database

In [64]:
cursor.execute('''SELECT * FROM EMPLOYEE''')
result = cursor.fetchall()
db_dataframe = pd.DataFrame(result, columns = ['first_name', 'last_name', 'age', 'sex', 'income' ])

In [65]:
db_dataframe

  first_name last_name  age sex      income
0    Leonard     Ortiz   40   M  10500000.0
1      Julio     Ortiz   33   M   5500000.0
2     Lorena      Diaz   37   F   6500000.0
3     Miguel      Diaz   32   F   4500000.0

## Non-Relational database

In [67]:
pip install pymongo

Collecting pymongo
  Downloading pymongo-3.12.0-cp38-cp38-win_amd64.whl (397 kB)
Installing collected packages: pymongo
Successfully installed pymongo-3.12.0
Note: you may need to restart the kernel to use updated packages.

In [1]:
from pymongo import MongoClient

In [2]:
client = MongoClient()